Учет_трудозатрат_EDT/src/Documents/ут_ВводТрудозатрат/ут_ВводТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ут_ВводТрудозатрат</name>
  <registerRecords>AccumulationRegister.ут_Трудозатраты</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>Подзадача</name>
      <type>
        <types>CatalogRef.ут_ПодзадачиВнутреннегоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_трудозатрат_EDT/src/AccumulationRegisters/ут_Трудозатраты/ут_Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ут_Трудозатраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подзадача</name>
    <type>
      <types>CatalogRef.ут_ПодзадачиВнутреннегоУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_трудозатрат_EDT/src/Documents/ут_ВводТрудозатрат/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ут_Трудозатраты 
	Движения.ут_Трудозатраты.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ут_Трудозатраты.Добавить();
		Движение.Период = Дата;
		Движение.Подзадача = ТекСтрокаЗатраты.Подзадача;
		Движение.Факт = ТекСтрокаЗатраты.Факт;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
